Перем Компонента;

Процедура Инициализировать() Экспорт
	
    ПодключениеВКУспешно = ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ3_v2_1_1_149_x64", "BITERP", ТипВнешнейКомпоненты.Native);
    
    Если Не ПодключениеВКУспешно Тогда
    	ВызватьИсключение "Не удалось подключить внешнюю компоненту PinkRabbitMQ";
    КонецЕсли;	
    
    Компонента = Новый("AddIn.BITERP.PinkRabbitMQ3"); 
   	
КонецПроцедуры

Процедура Подключиться(ВиртуальныйХост) Экспорт
	
	ПараметрыВиртуальногоХоста = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъекта(ВиртуальныйХост, "Владелец,Наименование");
	ПараметрыСервера = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъекта(ПараметрыВиртуальногоХоста.Владелец, "Адрес,Порт,ИмяПользователя,Пароль");
	Компонента.Connect(ПараметрыСервера.Адрес, ПараметрыСервера.Порт, ПараметрыСервера.ИмяПользователя, ПараметрыСервера.Пароль, ПараметрыВиртуальногоХоста.Наименование);
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение) Экспорт
	
	//@skip-warning
	ИмяОчереди = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение.ТочкаПодключения, "ИмяТочки");
	//@skip-warning
	СодержимоеСообщения = Сообщение.Данные.Получить();
	
	Попытка
	
		//@skip-warning
		Компонента.BasicPublish("", ИмяОчереди, СодержимоеСообщения, 0, Ложь);
		рмкОбработкаСообщений.ЗафиксироватьСтатусСообщения(Сообщение.Ссылка, "Отправлено");
		
	Исключение
		
		ПодробноеПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		рмкОбработкаСообщений.ЗафиксироватьСтатусСообщения(Сообщение, "Ошибка", ПодробноеПредставлениеОшибки);
		
	КонецПопытки	
	
КонецПроцедуры	

Процедура Закрыть() Экспорт
	
	Компонента = Неопределено;
	
КонецПроцедуры	

Процедура ПолучитьСообщенияИзОчереди(СлушательОчереди) Экспорт
	
	ПрочитанноеСообщение = "";
    ТегСообщения = 0;
	
	//Попытка
		
		ИмяОчереди = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(СлушательОчереди, "ИмяОчереди");
        Потребитель = Компонента.BasicConsume(ИмяОчереди, "", Ложь, Ложь, 100);
        
        Пока Компонента.BasicConsumeMessage("", ПрочитанноеСообщение, ТегСообщения, 5000) Цикл
           
           	// запишем сообщение
           	рмкОбработкаСообщений.СоздатьВходящееСообщение(СлушательОчереди, ПрочитанноеСообщение);
           
           // TODO сделать подтверждение только в случае успешного принятия сообщения
            Компонента.BasicAck(ТегСообщения);
            ПрочитанноеСообщение = ""; 			// Обнуляем, чтобы избежать утечку памяти
            ТегСообщения = 0; 					// Обнуляем, чтобы избежать утечку памяти
            
        КонецЦикла;
        
        Компонента.BasicCancel("");
        
    //Исключение
     //   Сообщить(Компонента.GetLastError());
    //КонецПопытки;
	
КонецПроцедуры	