Перем Компонента;

&Сервер	
Процедура Инициализировать() Экспорт
	
    ПодключениеВКУспешно = ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ3_v2_1_1_149_x64", "BITERP", ТипВнешнейКомпоненты.Native);
    
    Если Не ПодключениеВКУспешно Тогда
    	ВызватьИсключение "Не удалось подключить внешнюю компоненту PinkRabbitMQ";
    КонецЕсли;	
    
    Компонента = Новый("AddIn.BITERP.PinkRabbitMQ3"); 
   	
КонецПроцедуры

Процедура Подключиться(ВиртуальныйХост) Экспорт
	
	ПараметрыВиртуальногоХоста = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(ВиртуальныйХост, "Владелец,Наименование");
	ПараметрыСервера = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(ПараметрыВиртуальногоХоста.Владелец, "Адрес,Порт,ИмяПользователя,Пароль");
	Компонента.Connect(ПараметрыСервера.Адрес, ПараметрыСервера.Порт, ПараметрыСервера.ИмяПользователя, ПараметрыСервера.Пароль, ПараметрыВиртуальногоХоста.Наименование);
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение) Экспорт
	
	// отладочно
	ИмяОчереди = Сообщение.ТочкаПодключения.ИмяТочки;
	СодержимоеСообщения = Сообщение.Данные.Получить();
	
	//Попытка
	Компонента.BasicPublish("", ИмяОчереди, СодержимоеСообщения, 0, Ложь);
	//Исключение
	//КонецПопытки	
	
КонецПроцедуры	

Процедура Закрыть() Экспорт
	
	Компонента = Неопределено;
	
КонецПроцедуры	

Процедура ПолучитьСообщенияИзОчереди(СлушательОчереди) Экспорт
	
	ПрочитанноеСообщение = "";
    ТегСообщения = 0;
	
	//Попытка
		
		ИмяОчереди = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(СлушательОчереди, "ИмяОчереди");
        Потребитель = Компонента.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
        
        Пока Компонента.BasicConsumeMessage("", ПрочитанноеСообщение, ТегСообщения, 5000) Цикл
           
           	// запишем сообщение
           	ЗаписатьВходящееСообщение(СлушательОчереди, ПрочитанноеСообщение);
           
            Компонента.BasicAck(ТегСообщения);
            ПрочитанноеСообщение = ""; 			// Обнуляем, чтобы избежать утечку памяти
            ТегСообщения = 0; 					// Обнуляем, чтобы избежать утечку памяти
            
        КонецЦикла;
        
        Компонента.BasicCancel("");
        
    //Исключение
     //   Сообщить(Компонента.GetLastError());
    //КонецПопытки;
	
КонецПроцедуры	

Процедура ЗаписатьВходящееСообщение(СлушательОчереди, ПрочитанноеСообщение)
	
	СписокРеквизитов = "Сервер,ВиртуальныйХост,ИмяОчереди,СпособДесериализацииОбъекта,ИмяМетодаДесериализации";
	РеквизитыСлушателя = рмкОбщегоНазначенияПереопределяемый.ЗначенияРеквизитовОбъектов(СлушательОчереди, СписокРеквизитов);
	
	СообщениеОбъект = Справочники.рмкВходящиеСообщения.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СообщениеОбъект, РеквизитыСлушателя);
	СообщениеОбъект.Записать();
	
КонецПроцедуры