#Область ПрограммныйИнтерфейс

//@skip-check module-accessibility-at-client
Функция ПолучитьДоступныеМетоды() Экспорт
	
	ИменаМетодов = Новый Массив;
	ИменаМетодов.Добавить("ИсходящиеСообщения_СформироватьСообщение_Номенклатура");
		
	Возврат ИменаМетодов;
	
КонецФункции

//@skip-check module-accessibility-at-client
Процедура ВыполнитьМетод(ИмяМетода, Параметры) Экспорт
	
	Если ИмяМетода = "ИсходящиеСообщения_СформироватьСообщение_Номенклатура" Тогда
		ИсходящиеСообщения_СформироватьСообщение_Номенклатура(Параметры);
	ИначеЕсли ИмяМетода = "ВходящиеСообщения_ПрочитатьНоменклатуру" Тогда
		ВходящиеСообщения_ПрочитатьНоменклатуру(Параметры);
	Иначе
		ВызватьИсключение СтрШаблон("Не найден метод конвертации %1", ИмяМетода);
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-accessibility-at-client
Процедура ИсходящиеСообщения_СформироватьСообщение_Номенклатура(Параметры)
	
	ОбъектДляСериализации	= Параметры.ОбъектДляСериализации;
	ДанныеСообщения 		= Параметры.ДанныеСообщения;
	
	// задействуем платформенную сериализацию
	ДанныеСообщения.Вставить("Type", 	"SKU");
	//ДанныеСообщения.Вставить("SerializationMetod", 	"1CXDTO");
	//ДанныеСообщения.Вставить("SerializationObjectType", "SKU");
	ДанныеСообщения.Вставить("Content", ОбъектДляСериализации);
	
КонецПроцедуры	

//@skip-check module-accessibility-at-client
Процедура ВходящиеСообщения_ПрочитатьНоменклатуру(КонтейнерСообщения)
	
	ПроверитьТипВходящегоСообщения(КонтейнерСообщения, "SKU");
	
	НоменклатураОбъект = КонтейнерСообщения.Content;
	УстановитьДополнительныеПараметрыЗаписиОбъета(НоменклатураОбъект);
	НоменклатураОбъект.Записать();
	
КонецПроцедуры

//@skip-check module-accessibility-at-client
Процедура ПроверитьТипВходящегоСообщения(КонтейнерСообщения, ИмяТипа)
	
	ТипКорректен = КонтейнерСообщения.Свойство("Type") И СтрСравнить(КонтейнерСообщения.Type, ИмяТипа) = 0;
	
	Если Не ТипКорректен Тогда
		ВызватьИсключение СтрШаблон("Сообщение не содержит ожидаемый тип ""%1""", ИмяТипа);
	КонецЕсли;	
	
КонецПроцедуры	

//@skip-check module-accessibility-at-client
Процедура УстановитьДополнительныеПараметрыЗаписиОбъета(ЗаписываемыйОбъект)
	
	ЗаписываемыйОбъект.ОбменДанными.Загрузка = Истина;
		
КонецПроцедуры	

#КонецОбласти


	