
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр Тест_ОстаткиТоваров
	Движения.Тест_ОстаткиТоваров.Записывать = Истина;
	Движения.Тест_ОстаткиТоваров.Очистить();
	Движение = Движения.Тест_ОстаткиТоваров.Добавить();
	Движение.Период = Дата;
	Движение.Товар = Товар;
	Движение.Количество = Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
