
&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	ОтправитьСообщение(ИсходящееСообщение);
	
КонецПроцедуры

Процедура ОтправитьСообщение(Сообщение)
	
	// получаем сообщения
	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("Сообщение");
	ТаблицаСообщений.Колонки.Добавить("Сервер");
	ТаблицаСообщений.Колонки.Добавить("ВиртуальныйХост");
	ТаблицаСообщений.Колонки.Добавить("УниверсальнаяДатаСоздания");
	
	СтрокаСообщения = ТаблицаСообщений.Добавить();
	СтрокаСообщения.Сообщение = Сообщение;
	СтрокаСообщения.Сервер = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "Сервер");
	СтрокаСообщения.ВиртуальныйХост = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "ВиртуальныйХост");
	СтрокаСообщения.УниверсальнаяДатаСоздания = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "УниверсальнаяДатаСоздания");
	
	ОтправитьСообщения(ТаблицаСообщений);
	
КонецПроцедуры

// таблица сообщений должна содержать колонки
// сообщение (ссылка), сервер, виртуальный хост, универсальная дата создания
Процедура ОтправитьСообщения(ТаблицаСообщений)
	
	ТаблицаСообщений.Сортировать("Сервер,ВиртуальныйХост,УниверсальнаяДатаСоздания");
	ТаблицаХостов = ТаблицаСообщений.Скопировать();
	ТаблицаХостов.Свернуть("Сервер,ВиртуальныйХост");
	Отбор = Новый Структура("Сервер,ВиртуальныйХост");
	
	Коннектор = Обработки.рмкКоннектор.Создать();
	Коннектор.Инициализировать();
	
	// в цикле устанавливаем соединения
	Для Каждого СтрокаХоста Из ТаблицаХостов Цикл
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаХоста);
		СообщенияКОтправке = ТаблицаСообщений.НайтиСтроки(Отбор);

		Коннектор.Подключиться(СтрокаХоста.ВиртуальныйХост);
		
		Для Каждого СтрокаСообщения Из СообщенияКОтправке Цикл
			
			Коннектор.ОтправитьСообщение(СтрокаСообщения.Сообщение);
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Коннектор.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияИзОчередиНаСервере()
	
	Коннектор = Обработки.рмкКоннектор.Создать();
	Коннектор.Инициализировать();
	Коннектор.Подключиться(СлушательОчереди.ВиртуальныйХост);
	Коннектор.ПолучитьСообщенияИзОчереди(СлушательОчереди); 
	Коннектор.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщенияИзОчереди(Команда)
	
	ПолучитьСообщенияИзОчередиНаСервере();
	
КонецПроцедуры





