#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВсеСообщения(Команда)
	ОтправитьВсеСообщенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщенияИзОчереди(Команда)
	
	ПолучитьСообщенияИзОчередиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РазобратьВходящиеСообщения(Команда)
	
	РазобратьВходящиеСообщенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьВсеСообщения(Команда)
	
	ПолучитьВсеСообщенияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУстаревшиеСообщения(Команда)
	ОчиститьУстаревшиеСообщенияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьНаСервере()
	
	ОтправитьСообщение(ИсходящееСообщение);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщение(Сообщение)
	
	// получаем сообщения
	ТаблицаСообщений = Новый ТаблицаЗначений;
	ТаблицаСообщений.Колонки.Добавить("Сообщение");
	ТаблицаСообщений.Колонки.Добавить("Сервер");
	ТаблицаСообщений.Колонки.Добавить("ВиртуальныйХост");
	ТаблицаСообщений.Колонки.Добавить("УниверсальнаяДатаСоздания");
	
	СтрокаСообщения = ТаблицаСообщений.Добавить();
	СтрокаСообщения.Сообщение = Сообщение;
	СтрокаСообщения.Сервер = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "Сервер");
	СтрокаСообщения.ВиртуальныйХост = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "ВиртуальныйХост");
	СтрокаСообщения.УниверсальнаяДатаСоздания = рмкОбщегоНазначенияПереопределяемый.ЗначениеРеквизитаОбъекта(Сообщение, "УниверсальнаяДатаСоздания");
	
	рмкОбработкаСообщений.ОтправитьСообщения(ТаблицаСообщений);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВсеСообщенияНаСервере()
	
	рмкОбработкаСообщений.ОтправитьИсходящиеСообщения();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияИзОчередиНаСервере()
	
	МассивСлушателей = Новый Массив;
	МассивСлушателей.Добавить(СлушательОчереди);
	
	рмкОбработкаСообщений.ПолучитьСообщенияИзОчередей(МассивСлушателей);
	
КонецПроцедуры

&НаСервере
Процедура РазобратьВходящиеСообщенияНаСервере()
	
	рмкОбработкаСообщений.ВыполнитьРегламентОбработкиВходящихСообщений();
			
КонецПроцедуры

&НаСервере
Процедура ПолучитьВсеСообщенияНаСервере()
	
	рмкОбработкаСообщений.ПолучитьСообщенияИзОчередей();
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьУстаревшиеСообщенияНаСервере()
	
	рмкОбработкаСообщений.ОчиститьУстаревшиеСообщения();
	
КонецПроцедуры

#КонецОбласти