#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Объект.МенеджерКонвертации.Пустая() Тогда
		ЗаполнитьОбработчики(ЭтотОбъект);
	КонецЕсли;
		
	ДопустимыеМетаданные = рмкОбщегоНазначения.МетаданныеДоступныеДляРепликации();
	Элементы.ПолноеИмяМетаданных.СписокВыбора.ЗагрузитьЗначения(ДопустимыеМетаданные);
	УстановитьНадписьМетаданные(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МенеджерКонвертацииПриИзменении(Элемент)
	
	Объект.ИмяМетодаКонвертации = "";
	ЗаполнитьОбработчики(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьМетаданныеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыборМетаданныхПродолжение = Новый ОписаниеОповещения("ВыборМетаданныхПродолжение", ЭтотОбъект);
	ВыбранныеМетаданные = КолонкуТаблицыВМассив(Объект.МетаданныеДляРепликации, "ПолноеИмя");
	ПараметрыФормы = Новый Структура("ВыбранныеМетаданные", ВыбранныеМетаданные);
	
	ОткрытьФорму("Справочник.рмкТочкиПодключения.Форма.ФормаПодбораМетаданных", ПараметрыФормы, ЭтотОбъект, 
					, , , ВыборМетаданныхПродолжение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьМассивОбработчиков(СпособСериализации) 
		
	Попытка
		
		МенеджерКонвертации = рмкОбработкаСообщений.ПолучитьМенеджерКонвертации(Неопределено, СпособСериализации);
		МассивОбработчиков = МенеджерКонвертации.ПолучитьДоступныеМетоды("Исходящее")
		
	Исключение
		
		МассивОбработчиков = Новый Массив;
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		рмкОбщегоНазначенияПереопределяемый.СообщитьПользователю(ОписаниеОшибки);
				
	КонецПопытки;
	
	Возврат МассивОбработчиков;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьОбработчики(Форма)
	
	Форма.Элементы.ИмяМетодаКонвертации.СписокВыбора.Очистить();
	
	Обработчики = ПолучитьМассивОбработчиков(Форма.Объект.МенеджерКонвертации);
	
	Для Каждого ИмяОбработчика Из Обработчики Цикл
		Форма.Элементы.ИмяМетодаКонвертации.СписокВыбора.Добавить(ИмяОбработчика);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КолонкуТаблицыВМассив(Таблица, ИмяКолонки)
	
	Результат = Новый Массив; 
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Результат.Добавить(СтрокаТаблицы[ИмяКолонки]);
	КонецЦикла;
		
	Возврат Результат;	
	
КонецФункции	

&НаКлиенте
Процедура ВыборМетаданныхПродолжение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		
		Объект.МетаданныеДляРепликации.Очистить();
		
		Для Каждого ПолноеИмяМетаданных Из РезультатВыбора Цикл
			Объект.МетаданныеДляРепликации.Добавить().ПолноеИмя = ПолноеИмяМетаданных;
		КонецЦикла;	
		
		УстановитьНадписьМетаданные(ЭтотОбъект);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьНадписьМетаданные(Форма)
	
	КоличествоЭлементов = Форма.Объект.МетаданныеДляРепликации.Количество();
	ПредставлениеМетаданных = СтрСоединить(КолонкуТаблицыВМассив(Форма.Объект.МетаданныеДляРепликации, "ПолноеИмя"), ",");
	ПредельнаяДлинаОписания = 75;
	
	Если СтрДлина(ПредставлениеМетаданных) > ПредельнаяДлинаОписания Тогда
		ПредставлениеМетаданных = Лев(ПредставлениеМетаданных, ПредельнаяДлинаОписания - 3) + "...";
	КонецЕсли;	
		
	Форма.НадписьМетаданные = СтрШаблон("Метаданные (%1)", КоличествоЭлементов);
	
	Если Не ПустаяСтрока(ПредставлениеМетаданных) Тогда
		Форма.НадписьМетаданные = Форма.НадписьМетаданные + ": " + ПредставлениеМетаданных;
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти	


