#Область ПрограммныйИнтерфейс

#Область ОбработчикиРегламентныхЗаданий

Процедура ВыполнитьРегламентОтправкиИсходящихСообщений() Экспорт
	
	// процедура переопределена в расширении
	
КонецПроцедуры

Процедура ПолучитьСообщенияИзОчередей(СлушателиОчередей = Неопределено) Экспорт
	
	// процедура переопределена в расширении
	
КонецПроцедуры

Процедура ВыполнитьРегламентОбработкиВходящихСообщений() Экспорт
	
	// процедура переопределена в расширении
	
КонецПроцедуры

Процедура ОчиститьУстаревшиеСообщения() Экспорт
	
	// процедура переопределена в расширении
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 