#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(, "Необходимо записать виртуальный хост!");
		Возврат;
		
	Иначе
		Записать();
	КонецЕсли;
		
	ПроверитьПодключениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	
	Коннектор = Обработки.рмкКоннектор.Создать();
	
	Попытка
		
		Коннектор.Инициализировать();
		Коннектор.Подключиться(Объект.Ссылка);
		рмкОбщегоНазначенияПереопределяемый.СообщитьПользователю("Подключение успешно!");
		
	Исключение
		
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		рмкОбщегоНазначенияПереопределяемый.СообщитьПользователю(ОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

