#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьСодержимоеСообщения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьСодержимоеСообщения()
	
	Если Не Объект.Ссылка.Пустая() Тогда
		
		ДанныеСообщения = РеквизитФормыВЗначение("Объект").Данные.Получить();
		
		Если ТипЗнч(ДанныеСообщения) = Тип("Строка") Тогда
			СодержимоеСообщения = ДанныеСообщения;
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти