#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТипИнформации <> ПредопределенноеЗначение("Перечисление.рмкТипыПередаваемойИнформации.Данные") Тогда
		
		ПроверяемыеРеквизиты.Добавить("ИмяДляРазработчика");
		
	Иначе
			
		ПроверяемыеРеквизиты.Добавить("МенеджерКонвертации");
		ПроверяемыеРеквизиты.Добавить("ИмяМетодаКонвертации");
		ПроверяемыеРеквизиты.Добавить("МетаданныеДляРепликации");	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТипИнформации <> ПредопределенноеЗначение("Перечисление.рмкТипыПередаваемойИнформации.Данные") Тогда
		
		МенеджерКонвертации 	= Неопределено;
		ИмяМетодаКонвертации 	= "";
		МетаданныеДляРепликации.Очистить();
		
	КонецЕсли;
		
	Если ТипИнформации <> ПредопределенноеЗначение("Перечисление.рмкТипыПередаваемойИнформации.Логи") Тогда
		ИмяДляРазработчика = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли