#Область ПрограммныйИнтерфейс
	
Функция ЗначениеРеквизитаОбъекта(Объект, ИмяРеквизита) Экспорт

	// в конфигурации на БСП заменить на вызов метода "ОбщегоНазначения.ЗначениеРеквизитаОбъекта"	
	Возврат Объект[ИмяРеквизита];
	
КонецФункции	

Функция ЗначенияРеквизитовОбъекта(Объект, ИменаРеквизитов) Экспорт

	// в конфигурации на БСП заменить на вызов метода "ОбщегоНазначения.ЗначениеРеквизитаОбъекта"	
	ЗначенияРеквизитов = Новый Структура(ИменаРеквизитов);
	
	Для Каждого КлючИЗначение Из ЗначенияРеквизитов Цикл
		ЗначенияРеквизитов.Вставить(КлючИЗначение.Ключ, Объект[КлючИЗначение.Ключ]);
	КонецЦикла; 
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

Функция СсылкаСуществует(Ссылка) Экспорт
	
	ПолноеИмяМетаданных = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	1
	|ИЗ
	|	" + ПолноеИмяМетаданных + " КАК Таблица
	|ГДЕ
	|	Таблица.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти