
Функция ПолучитьДоступныеМетоды() Экспорт
	
	ИменаМетодов = Новый Массив;
	ИменаМетодов.Добавить("ИсходящиеСообщения_СтандартноСериализоватьВJSON");
	ИменаМетодов.Добавить("ВходящиеСообщения_СтандартноДесериализоватьИзJSON");
		
	Возврат ИменаМетодов;
	
КонецФункции

Процедура ВыполнитьМетод(ИмяМетода, Параметры) Экспорт
	
	Если ИмяМетода = "ИсходящиеСообщения_СтандартноСериализоватьВJSON" Тогда
		
	ИначеЕсли ИмяМетода = "ВходящиеСообщения_СтандартноДесериализоватьИзJSON" Тогда 	
		
	Иначе
		ВызватьИсключение СтрШаблон("Не найден метод конвертации %1", ИмяМетода);
	КонецЕсли;	
	
КонецПроцедуры


	